api/app/controllers/application_controller.rb

SELECT "staffs".* FROM "staffs" WHERE "staffs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_staff
    if decoded_token
      staff_id = decoded_token[0]["staff_id"]
      @sid = Staff.find_by(id: staff_id)