api/app/controllers/auth_controller.rb

SELECT "staffs".* FROM "staffs" WHERE "staffs"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
---
    def create
      @staff = Staff.find_by(name: staff_login_params[:name])