api/app/controllers/bags_controller.rb

SELECT "bags".* FROM "bags"
---
  def index
    @bags = Bag.all

INSERT INTO "bags" ("name", "sold", "stored", "shop_id", "category_id", "image_data", "price", "sold_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bag = Bag.new(bag_params)
    puts @bag
    if @bag.save

UPDATE "bags" SET "image_data" = ?, "updated_at" = ? WHERE "bags"."id" = ?
---
  def update
    if @bag.update(bag_params)

DELETE FROM "bags" WHERE "bags"."id" = ?  [["id", 1]]
---
  def destroy
    @bag.destroy

SELECT "bags".* FROM "bags" WHERE "bags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_bag
      @bag = Bag.find(params[:id])