api/app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT "shops".* FROM "shops"

  def create
    @shop = Shop.new(shop_params)

    if @shop.save
---
INSERT INTO "shops" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Shop 2"], ["created_at", "2023-06-13 08:41:36.681959"], ["updated_at", "2023-06-13 08:41:36.681959"]]

  def update
    if @shop.update(shop_params)
---
UPDATE "shops" SET "name" = ?, "updated_at" = ? WHERE "shops"."id" = ?  [["name", "Shop 2"], ["updated_at", "2023-06-13 08:42:47.633477"], ["id", 1]]

  def destroy
    @shop.destroy
---
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 2]]

    def set_shop
      @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]