api/app/controllers/staffs_controller.rb

  def index
    @staffs = Staff.all
---
SELECT "staffs".* FROM "staffs"

  def create
    @staff = Staff.new(staff_params)

    if @staff.save
---
INSERT INTO "staffs" ("name", "password_digest", "phone_number", "role", "shop_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @staff.update(staff_params)
---
UPDATE "staffs" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "staffs"."id" = ?  [["name", "test21"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-06-13 09:29:38.234712"], ["id", 2]]

  def destroy
    @staff.destroy
---
DELETE FROM "staffs" WHERE "staffs"."id" = ?  [["id", 2]]

    def set_staff
      @staff = Staff.find(params[:id])
---
SELECT "staffs".* FROM "staffs" WHERE "staffs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]